<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 模板设置
// +----------------------------------------------------------------------

return [
    // 模板引擎类型 支持 php think 支持扩展
    'type'            => 'Think',
    // 模板路径
    'view_path'       => '',
    // 模板后缀
    'view_suffix'     => '.html',
    // 预先加载的标签库
    'taglib_pre_load' => 'app\\admin\\taglib\\Tp',
    // 默认主题
    'default_theme'   => '',
    // 模板参数
    'tpl_replace_string' => [ // 视图输出字符串内容替换
        '__ROOT__'   => '/',
        '__STATIC__' => '/static/admin',
        '__STATIC2__' => '/static/admin2',
        '__LIB__'    => '/static/admin/lib',
    ],
    'default_filter' => ''
];
